Revit 2024 API
BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletError Property
 Fillet cannot be created between rail segment since the radius is lower than the profile size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RailProfileLowerThanFilletError { get; }
Visual Basic
Public Shared ReadOnly Property RailProfileLowerThanFilletError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RailProfileLowerThanFilletError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace